Following the pandas to SQL tutorial by Greg Reda
http://www.gregreda.com/2013/10/26/intro-to-pandas-data-structures/

## Administrative setup

In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
pd.set_option('max_columns',100)
%matplotlib inline
import seaborn
# Set seaborn aesthetic parameters to defaults - just to make plots stand out!
seaborn.set()

## Exploring Series and DataFrame

Pandas introduces 2 new data structures - series and DataFrame, both built on top of NumPy.

### Introducing Series

Series is a one dimensional object similar to a list or an array, that can take in any datatype. It assigns a labeled index to each item. Alternatively, you can specify index to the series.

In [2]:
s = pd.Series(['abcd',3.14159,True,-12345,None,0.0])
s

0       abcd
1    3.14159
2       True
3     -12345
4       None
5          0
dtype: object

In [3]:
s_hat = pd.Series(['abcd',3.14159,True,-12345,None,0.0],index = ['A','B','C','D','E','F'])
s_hat

A       abcd
B    3.14159
C       True
D     -12345
E       None
F          0
dtype: object

The Series Constructor can be used to convert a dict as well.

In [11]:
d = {'Sydney':4000,'Melbourne':2500,'Adelaide':3200,'Perth':5800,'Hobart':1700,'Darwin':48,'Brisbane':9000}
d

{'Adelaide': 3200,
 'Brisbane': 9000,
 'Darwin': 48,
 'Hobart': 1700,
 'Melbourne': 2500,
 'Perth': 5800,
 'Sydney': 4000}

In [37]:
cities = pd.Series(d)
cities

Adelaide     3200
Brisbane     9000
Darwin         48
Hobart       1700
Melbourne    2500
Perth        5800
Sydney       4000
dtype: int64

In [14]:
print "Dict is of type ", type(d)
print "Series is of type ", type(cities)

Dict is of type  <type 'dict'>
Series is of type  <class 'pandas.core.series.Series'>

Notice how both cities and 'd' are arranged alphabetically.

In [10]:
cities.sort_values()
cities

Darwin         48
Hobart       1700
Melbourne    2500
Adelaide     3200
Sydney       4000
Perth        5800
Brisbane     9000
dtype: int64

In [16]:
d['Adelaide']

3200

In [18]:
cities['Adelaide']

3200

Advantage of Series is that you can select indexes using different strategies

In [17]:
cities[3]

3200

In [19]:
d[3]

KeyError: 3

Also, you can use boolean subsetting. The series returns only the true elements.

In [21]:
cities[cities < 2000]

Darwin      48
Hobart    1700
dtype: int64

In [22]:
d[d < 2000]

KeyError: False

This last part may be a bit weird. How did the subsetting work? This may help.

In [25]:
less_than_2000 = cities < 2000
print less_than_2000
print '\n'
print cities[cities < 2000]

Darwin        True
Hobart        True
Melbourne    False
Adelaide     False
Sydney       False
Perth        False
Brisbane     False
dtype: bool


Darwin      48
Hobart    1700
dtype: int64

You can change the values of elements in a Series on the fly

In [38]:
# changing values of elements below 2000
print cities[cities < 2000]
print '\n'
cities[cities < 2000] = cities.mean()/2
print cities[cities < 2000]

Darwin      48
Hobart    1700
dtype: int64


Darwin    1874.857143
Hobart    1874.857143
dtype: float64

You can subset multiple elements by using double brackets. Single brackets gives you a key error.

In [63]:
cities[['Sydney','Hobart','Melbourne']]

Sydney          4000
Hobart       1874.86
Melbourne       2500
dtype: object

In [64]:
cities['Sydney','Hobart','Melbourne']

KeyError: ('Sydney', 'Hobart', 'Melbourne')

Use idiomatic python to check if an element is in the series or not

In [39]:
print 'Auckland' in cities
print 'Sydney' in cities
print 'sydney' in cities

False
True
False

Append elements to the Series: Very simple.

In [57]:
cities['Auckland'] = None
cities

Adelaide        3200
Brisbane        9000
Darwin       1874.86
Hobart       1874.86
Melbourne       2500
Perth           5800
Sydney          4000
Auckland        None
dtype: object

You can do mathematical operations on the series elements using scalar operations

In [40]:
cities/3

Adelaide     1066.666667
Brisbane     3000.000000
Darwin        624.952381
Hobart        624.952381
Melbourne     833.333333
Perth        1933.333333
Sydney       1333.333333
dtype: float64

In [41]:
np.square(cities)

Adelaide     10240000.000000
Brisbane     81000000.000000
Darwin        3515089.306122
Hobart        3515089.306122
Melbourne     6250000.000000
Perth        33640000.000000
Sydney       16000000.000000
dtype: float64

Null checking performed using isnull and notnull functions

In [60]:
print cities.isnull()
print '\n'
print cities.notnull()

Adelaide     False
Brisbane     False
Darwin       False
Hobart       False
Melbourne    False
Perth        False
Sydney       False
Auckland      True
dtype: bool


Adelaide      True
Brisbane      True
Darwin        True
Hobart        True
Melbourne     True
Perth         True
Sydney        True
Auckland     False
dtype: bool

You can add 2 series together. Non intersecting values yield NaN

In [65]:
cities[['Adelaide','Sydney','Melbourne','Brisbane']] + cities[['Hobart','Sydney','Melbourne']]

Adelaide      NaN
Brisbane      NaN
Hobart        NaN
Melbourne    5000
Sydney       8000
dtype: object

## Exploring DataFrames

You can create a dataframe by passing a dictionary of lists

In [2]:
data = {'year':[2010,2011,2012,2013,2014,2015,2016],
        'team':['Crows','Lions','Magpies','Bombers','Hawks','Swans','Bulldogs'],
        'wins':[11,8,10,15,11,6,4],
        'losses':[3,4,1,5,6,2,0]}
print type(data)
print '\n'
data

<type 'dict'>

{'losses': [3, 4, 1, 5, 6, 2, 0],
 'team': ['Crows',
  'Lions',
  'Magpies',
  'Bombers',
  'Hawks',
  'Swans',
  'Bulldogs'],
 'wins': [11, 8, 10, 15, 11, 6, 4],
 'year': [2010, 2011, 2012, 2013, 2014, 2015, 2016]}

In [26]:
footie = pd.DataFrame(data)
footie

   losses      team  wins  year
0       3     Crows    11  2010
1       4     Lions     8  2011
2       1   Magpies    10  2012
3       5   Bombers    15  2013
4       6     Hawks    11  2014
5       2     Swans     6  2015
6       0  Bulldogs     4  2016

The columns parameter allows us to tell the dataframe constructor about the ordering and filtering of columns. By default, ordering is alphabetical as seen above.

In [5]:
footie = pd.DataFrame(data,columns = ['year','team','wins','losses'])
footie

   year      team  wins  losses
0  2010     Crows    11       3
1  2011     Lions     8       4
2  2012   Magpies    10       1
3  2013   Bombers    15       5
4  2014     Hawks    11       6
5  2015     Swans     6       2
6  2016  Bulldogs     4       0

In [9]:
footie = pd.DataFrame(data,columns = ['year','team','wins'])
print footie
print '\n'
# note that losses didn't come through because of the columns parameter
footie['losses']

   year      team  wins
0  2010     Crows    11
1  2011     Lions     8
2  2012   Magpies    10
3  2013   Bombers    15
4  2014     Hawks    11
5  2015     Swans     6
6  2016  Bulldogs     4

KeyError: 'losses'

### Read csv files

Downloaded dataset containing location of centrelink offices in australia as of 2015.
Download location - https://data.gov.au/dataset/location-of-centrelink-offices

In [13]:
# "!" command is used to execute shell commands
!head -n 5 centrelink.csv

OFFICE TYPE,SITE NAME,ALTERNATIVE NAME,ADDRESS,SUBURB,STATE,POSTCODE,LATITUDE,LONGITUDE,Open,Close,Closed for lunch/Office Notes
Centrelink Customer Service Centre,Albury,,430 Wilson Street,Albury,NSW,2640,-36.07727,146.92370,08:30:00,16:30:00,No
Centrelink Customer Service Centre,Townsville Jobseekers,,307 Ross River Road,Aitkenvale,QLD,4814,-19.29713,146.76441,08:30:00,16:30:00,No
Centrelink Customer Service Centre,Albany,,15 Peels Place,Albany,WA,6330,-35.02591,117.88466,08:30:00,16:30:00,No
Centrelink Customer Service Centre,Alice Springs,,5 Railway Terrace,Alice Springs,NT,870,-23.69590,133.88036,08:30:00,16:30:00,No

In [14]:
empdata = pd.read_csv('centrelink.csv')
empdata.head()

,OFFICE TYPE,SITE NAME,ALTERNATIVE NAME,ADDRESS,SUBURB,STATE,POSTCODE,LATITUDE,LONGITUDE,Open,Close,Closed for lunch/Office Notes
0,Centrelink Customer Service Centre,Albury,NaN,430 Wilson Street,Albury,NSW,2640,-36.07727,146.92370,08:30:00,16:30:00,No
1,Centrelink Customer Service Centre,Townsville Jobseekers,NaN,307 Ross River Road,Aitkenvale,QLD,4814,-19.29713,146.76441,08:30:00,16:30:00,No
2,Centrelink Customer Service Centre,Albany,NaN,15 Peels Place,Albany,WA,6330,-35.02591,117.88466,08:30:00,16:30:00,No
3,Centrelink Customer Service Centre,Alice Springs,NaN,5 Railway Terrace,Alice Springs,NT,870,-23.69590,133.88036,08:30:00,16:30:00,No
4,Centrelink Customer Service Centre,Tangentyere,NaN,4 Elder Street,Alice Springs,NT,870,-23.69924,133.87184,08:30:00,15:00:00,12:00:00 to 13:00:00

Pandas has several 'reader' functions that have parameters allowing us to do things like skip lines of a file, parse dates, specify how to handle NA datapoints. You can find these here -

In [22]:
# ?pd.read_csv

Pandas also has similar writer functions for different formats like

In [23]:
# empdata.to_csv('path_to_file.csv')

### Read excel files

Pandas can help read and write Excel files. This means we can read from Excel, write code in Python, and write back into Excel. No need for VBA.

Reading excel files requires a library called "xlrd". You can install it via pip (pip install xlrd)

<img src="https://imgs.xkcd.com/comics/python.png">

In [2]:
import this

The Zen of Python, by Tim Peters

Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
Flat is better than nested.
Sparse is better than dense.
Readability counts.
Special cases aren't special enough to break the rules.
Although practicality beats purity.
Errors should never pass silently.
Unless explicitly silenced.
In the face of ambiguity, refuse the temptation to guess.
There should be one-- and preferably only one --obvious way to do it.
Although that way may not be obvious at first unless you're Dutch.
Now is better than never.
Although never is often better than *right* now.
If the implementation is hard to explain, it's a bad idea.
If the implementation is easy to explain, it may be a good idea.
Namespaces are one honking great idea -- let's do more of those!

In [25]:
import xlrd

Let's write the footie data into an xlsx.

In [27]:
# since index on our footie data is meaningless, there's no need to write it.
footie.to_excel('footie.xlsx',index = False)

In [28]:
!ls -ltr *.xlsx

-rw-r--r--  1 Vivek  staff  5605  1 Jan 20:38 footie.xlsx

In [29]:
# delete the dataframe

del footie

In [30]:
# read from Excel

footie = pd.read_excel('footie.xlsx','Sheet1')
footie

   losses      team  wins  year
0       3     Crows    11  2010
1       4     Lions     8  2011
2       1   Magpies    10  2012
3       5   Bombers    15  2013
4       6     Hawks    11  2014
5       2     Swans     6  2015
6       0  Bulldogs     4  2016

### Reading URL

You can also read directly from a URL. Let me try with the Centrelink url that I provided for the CSV.

In [36]:
url = 'http://data.gov.au/dataset/70c2b2fe-2a32-450e-98dc-453fe4a02aae/resource/5a45d7b2-8579-425b-bb46-53a0e0bfa053/download/Centrelink-Office-Locations-as-at--2-December-2015.csv'

# let's see how much time it takes to download the data
# need to import the datetime library
from datetime import datetime

print datetime.now().time()
empdata_from_url = pd.read_table(url)
print datetime.now().time()

empdata_from_url.head()

20:52:20.629146
20:52:26.245874

  OFFICE TYPE,SITE NAME,ALTERNATIVE NAME,ADDRESS,SUBURB,STATE,POSTCODE,LATITUDE,LONGITUDE,Open,Close,Closed for lunch/Office Notes
0  Centrelink Customer Service Centre,Albury,,430...
1  Centrelink Customer Service Centre,Townsville ...
2  Centrelink Customer Service Centre,Albany,,15 ...
3  Centrelink Customer Service Centre,Alice Sprin...
4  Centrelink Customer Service Centre,Tangentyere...

If I have a tab separated table, then use the command - sep='\t', otherwise use sep=','

In [38]:
print datetime.now().time()
empdata_from_url = pd.read_table(url,sep=',')
print datetime.now().time()

empdata_from_url.head(3)

20:54:44.227679
20:54:50.622689

,OFFICE TYPE,SITE NAME,ALTERNATIVE NAME,ADDRESS,SUBURB,STATE,POSTCODE,LATITUDE,LONGITUDE,Open,Close,Closed for lunch/Office Notes
0,Centrelink Customer Service Centre,Albury,NaN,430 Wilson Street,Albury,NSW,2640,-36.07727,146.92370,08:30:00,16:30:00,No
1,Centrelink Customer Service Centre,Townsville Jobseekers,NaN,307 Ross River Road,Aitkenvale,QLD,4814,-19.29713,146.76441,08:30:00,16:30:00,No
2,Centrelink Customer Service Centre,Albany,NaN,15 Peels Place,Albany,WA,6330,-35.02591,117.88466,08:30:00,16:30:00,No

#### Reading and writing into Databases

Pandas has support for reading and writing into databases. Additionally, you can read into pandas from the clipboard as well. But let me get to these at a later time.

## Joining

pandas.merge provides SQL join type of capabilities. The 'how' parameter defines the kind of join. From the docco - 

how : {'left', 'right', 'outer', 'inner'}, default 'inner'
    * left: use only keys from left frame (SQL: left outer join)
    * right: use only keys from right frame (SQL: right outer join)
    * outer: use union of keys from both frames (SQL: full outer join)
    * inner: use intersection of keys from both frames (SQL: inner join)

In [104]:
# ?pd.merge

In [108]:
#  defining the datasets
left_data = pd.DataFrame({'key':range(5),'left_val':['a','b','c','d','e']})
print left_data
print '\n'

right_data = pd.DataFrame({'key':range(2,7),'right_val':['f','g','h','i','j']})
print right_data

   key left_val
0    0        a
1    1        b
2    2        c
3    3        d
4    4        e


   key right_val
0    2         f
1    3         g
2    4         h
3    5         i
4    6         j

Notice how i used range to define a range of integers. Range(2,7) defines integers between 2 to 6 since these are 0 indexed.

In [109]:
# INNER JOIN
pd.merge(left_data, right_data, on= 'key', how='inner')

   key left_val right_val
0    2        c         f
1    3        d         g
2    4        e         h

The fields to be joined on for both left and right tables can be specified explicitly, instead of using a generic "ON".

In [118]:
# LEFT OUTER JOIN

pd.merge(left_data,right_data,left_on='key',right_on='key',how= 'left')

   key left_val right_val
0    0        a       NaN
1    1        b       NaN
2    2        c         f
3    3        d         g
4    4        e         h

I tried selecting specific rows in the left_data and right_data, but couldn't select only the left_val and right_val. Need to investigate.

Instead of joining on a specific column, you can also join on the index.

In [119]:
pd.merge(left_data,right_data,left_index=True,right_index=True,how='inner')

   key_x left_val  key_y right_val
0      0        a      2         f
1      1        b      3         g
2      2        c      4         h
3      3        d      5         i
4      4        e      6         j

The join can be a combination of column on one table and key on the other table.

In [121]:
pd.merge(left_data,right_data,left_index=True,right_on='key',how='inner')

   key  key_x left_val  key_y right_val
0    2      2        c      2         f
1    3      3        d      3         g
2    4      4        e      4         h

Similar to a left join, you can also merge like a right outer join, or a full outer join.

In [123]:
pd.merge(left_data,right_data, on = 'key', how='outer')

   key left_val right_val
0    0        a       NaN
1    1        b       NaN
2    2        c         f
3    3        d         g
4    4        e         h
5    5      NaN         i
6    6      NaN         j

### Unioning

Pandas can combine DataFrames along an axis using "pd.concat".

In [127]:
pd.concat([left_data,right_data])

   key left_val right_val
0    0        a       NaN
1    1        b       NaN
2    2        c       NaN
3    3        d       NaN
4    4        e       NaN
0    2      NaN         f
1    3      NaN         g
2    4      NaN         h
3    5      NaN         i
4    6      NaN         j

Pandas offers some more flexibility to an RDBMS by allowing side-by-side concatenation, like so -

In [128]:
pd.concat([left_data,right_data], axis = 1)

   key left_val  key right_val
0    0        a    2         f
1    1        b    3         g
2    2        c    4         h
3    3        d    5         i
4    4        e    6         j

### Grouping

#### Using a new dataset to explore grouping using the chicago salaries. SALARY DATASET.

Why? This is because it'll help me explore the lambda function. You'll see.

Dataset is available here - https://raw.githubusercontent.com/gjreda/gregreda.com/master/content/notebooks/data/city-of-chicago-salaries.csv

In [131]:
url = 'https://raw.githubusercontent.com/gjreda/gregreda.com/master/content/notebooks/"\
       data/city-of-chicago-salaries.csv'
salaries = pd.read_table(url, sep=',')
salaries.head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$85512.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$75372.00
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$80916.00

NOTE - I CONTINUED THE LINK IN SECOND LINE BY CLOSING THE DOUBLE QUOTES AND HITTING \ SYMBOL

1. We can see that the employee annual salary has a dollar sign in the beginning, so python will consider it as a string. We need to fix that.
2. Column names are also with spaces and multiple words. Let's fix that as well.

In [136]:
# ?pd.read_table

Check out the "converters" parameter for the read_table or read_csv command. It says

converters : dict, default None
    Dict of functions for converting values in certain columns. Keys can either
    be integers or column labels
    
Let's use this to convert the salary field into float.

In [147]:
# read the salaries data from Greg's github
salaries = pd.read_table(url,
                         sep = ',',
                         converters={'Employee Annual Salary': lambda x: float(x.replace('$', ''))})

# changing column names to single word
headers = ['name','title','department','salary']
salaries.columns = headers

salaries.head(3)

                  name                     title        department  salary
0      AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT   85512
1    AARON,  JEFFERY M            POLICE OFFICER            POLICE   75372
2  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES   80916

#### Using pandas groupby

In [151]:
by_dept = salaries.groupby('department')
by_dept

Use an aggregate function on these groupings to make sense. COUNT function gives the number of non-null values of each column in each group. SIZE gives the total number of records in each group.

In [155]:
print by_dept.count().head()
print '\n'
print by_dept.size().head()

                   name  title  salary
department
ADMIN HEARNG         42     42      42
ANIMAL CONTRL        61     61      61
AVIATION           1218   1218    1218
BOARD OF ELECTION   110    110     110
BOARD OF ETHICS       9      9       9


department
ADMIN HEARNG           42
ANIMAL CONTRL          61
AVIATION             1218
BOARD OF ELECTION     110
BOARD OF ETHICS         9
dtype: int64

Using other functions. Oh, pandas has median as well. pandas - 1, SQL - 0!

In [157]:
print by_dept.mean()[20:25]
print '\n'
print by_dept.median()[20:25]

                         salary
department
HUMAN RESOURCES    71337.176471
INSPECTOR GEN      80703.000000
IPRA               82425.035294
LAW                70853.156000
LICENSE APPL COMM  65436.000000


                   salary
department
HUMAN RESOURCES     68496
INSPECTOR GEN       76116
IPRA                82524
LAW                 66492
LICENSE APPL COMM   65436

Note that it automatically considered 'salary' for median and mean calculations because that was the only float variable.

Note for below - carriage return in ipython notebook is by typing "< b r />" (without the spaces)

#### Perform individual operations within a groupby

SQL example - 

SELECT department, COUNT(DISTINCT title) <br />
FROM salaries<br/>
GROUP BY department<br/>
ORDER BY 2 DESC<br/>
LIMIT 5;

The pandas equivalent is -

In [161]:
by_dept.title.nunique().order(ascending = False)[:5]
# you can also display top 5 as 
# by_dept.title.nunique().order(ascending = False).head()

/Users/Vivek/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

department
WATER MGMNT    153
TRANSPORTN     150
POLICE         130
AVIATION       125
HEALTH         118
Name: title, dtype: int64

#### Harnessing the power of the 'groupby' in a split-apply-combine situation

Say you want to find the highest paid employee within each department. How would I do this in SQL -

select b.name, b.department, b.salary<br\>
from salaries b<br\>
inner join<br\>
(Select a.department, max(a.salary) as max_sal<br\>
from salaries a<br\>
group by a.department)<br\>
on a.department = b.department and<br\>
   a.max_sal = b.salary<br\>

Here's an inventive way to do this in pandas.

1. Sort dataset in descending
2. Run groupby and apply a custom function that assigns numbers to each group
3. This gives a rank order within each group
4. If you want the highest paid employee, then simply pick the employees with rank 1.

For the custom function, you can use the numpy arange function.<br/>
np.arange(10) gives evenly spaced numbers until the number i.e 0,1,2,3,4,5,6,7,8,9

In [165]:
def ranker(df_group):
    # assumes employees are sorted in descending order. This way, the highest paid employee will be assigned
    # department_rank of 1
    df_group['department_rank'] = np.arange(len(df_group))+1
    return(df_group)

In [178]:
salaries.sort(columns = 'salary', ascending = False, inplace = True)
salaries_sorted = salaries.groupby('department').apply(ranker)
print "there are ", len(salaries_sorted[salaries_sorted.department_rank == 1]), "department maxxers"
print '\n'
print "Some of them are as follows"
salaries_sorted[salaries_sorted.department_rank == 1][:5]

there are  35 department maxxers


Some of them are as follows

/Users/Vivek/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  if __name__ == '__main__':

,name,title,department,salary,department_rank
18039,"MC CARTHY, GARRY F",SUPERINTENDENT OF POLICE,POLICE,260004,1
8004,"EMANUEL, RAHM",MAYOR,MAYOR'S OFFICE,216210,1
25588,"SANTIAGO, JOSE A",FIRE COMMISSIONER,FIRE,202728,1
763,"ANDOLINO, ROSEMARIE S",COMMISSIONER OF AVIATION,AVIATION,186576,1
4697,"CHOUCAIR, BECHARA N",COMMISSIONER OF HEALTH,HEALTH,177156,1

If we want to see top salaries for cops in chicago govt, then -

In [181]:
salaries_sorted[salaries_sorted.department == 'POLICE'][:10]

,name,title,department,salary,department_rank
18039,"MC CARTHY, GARRY F",SUPERINTENDENT OF POLICE,POLICE,260004,1
31587,"WYSINGER, ALFONZA",FIRST DEPUTY SUPERINTENDENT,POLICE,188316,2
19175,"MINIOTIS, CONSTANTINE",SUPERINTENDENT'S CHIEF OF STAFF,POLICE,185004,3
28955,"TRACY, ROBERT J",CHIEF,POLICE,185004,4
8095,"ESCALANTE, JOHN J",CHIEF,POLICE,176532,5
30907,"WILLIAMS, EUGENE E",CHIEF,POLICE,176532,6
11058,"GULLIFORD, WAYNE M",CHIEF,POLICE,176532,7
14999,"KIRBY, DEBRA K",CHIEF,POLICE,176532,8
24921,"ROTI, NICHOLAS J",CHIEF,POLICE,176532,9
24156,"RIVERA, JUAN J",CHIEF,POLICE,176532,10

Fin.